return {
	[1] = {
		["id"] = 1,
		["name"] = "道具",
		["type"] = "item",
		["screening"] = {
			[1] = {
				[1] = "conf",
				[2] = "lv",
				[3] = "道具品质",
				[4] = "-1",
			},
			[2] = {
				[1] = "data",
				[2] = "count",
				[3] = "道具数量",
				[4] = "-1",
			},
		},
		["sort"] = 1,
	},
	[2] = {
		["id"] = 2,
		["name"] = "碎片",
		["type"] = "chip",
		["screening"] = {
			[1] = {
				[1] = "conf",
				[2] = "lv",
				[3] = "碎片品质",
				[4] = "-1",
			},
			[2] = {
				[1] = "data",
				[2] = "count",
				[3] = "碎片数量",
				[4] = "-1",
			},
		},
		["sort"] = 2,
	},
	[3] = {
		["id"] = 3,
		["name"] = "装备",
		["type"] = "equip",
		["screening"] = {
			[1] = {
				[1] = "data",
				[2] = "level",
				[3] = "装备等级",
				[4] = "-1",
			},
			[2] = {
				[1] = "conf",
				[2] = "lv",
				[3] = "装备品质",
				[4] = "-1",
			},
		},
		["sort"] = 3,
	},
	[4] = {
		["id"] = 4,
		["name"] = "铭文",
		["type"] = "inscription",
		["screening"] = {
			[1] = {
				[1] = "conf",
				[2] = "lv",
				[3] = "铭文品质",
				[4] = "-1",
			},
			[2] = {
				[1] = "data",
				[2] = "count",
				[3] = "铭文数量",
				[4] = "-1",
			},
		},
		["sort"] = 4,
	},
}
