return {
	["1_1"] = {
		["id"] = "1_1",
		["type"] = "army111",
		["name"] = "一闪",
		["icon"] = "skill_icon1",
		["lv"] = 1,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加35%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.35",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1000",
			},
		},
		["point_num"] = 100,
	},
	["1_2"] = {
		["id"] = "1_2",
		["type"] = "army111",
		["name"] = "一闪",
		["icon"] = "skill_icon1",
		["lv"] = 2,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加36%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.36",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 200,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1001",
			},
		},
	},
	["1_3"] = {
		["id"] = "1_3",
		["type"] = "army111",
		["name"] = "一闪",
		["icon"] = "skill_icon1",
		["lv"] = 3,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加37%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.37",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 300,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1002",
			},
		},
	},
	["1_4"] = {
		["id"] = "1_4",
		["type"] = "army111",
		["name"] = "一闪",
		["icon"] = "skill_icon1",
		["lv"] = 4,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加38%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.38",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 400,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1003",
			},
		},
	},
	["1_5"] = {
		["id"] = "1_5",
		["type"] = "army111",
		["name"] = "一闪",
		["icon"] = "skill_icon1",
		["lv"] = 5,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加39%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.39",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 500,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1004",
			},
		},
	},
	["1_6"] = {
		["id"] = "1_6",
		["type"] = "army111",
		["name"] = "一闪",
		["icon"] = "skill_icon1",
		["lv"] = 6,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加40%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.40",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1005",
			},
		},
		["point_num"] = 600,
	},
	["1_7"] = {
		["id"] = "1_7",
		["type"] = "army111",
		["name"] = "一闪",
		["icon"] = "skill_icon1",
		["lv"] = 7,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加41%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.41",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 700,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1006",
			},
		},
	},
	["1_8"] = {
		["id"] = "1_8",
		["type"] = "army111",
		["name"] = "一闪",
		["icon"] = "skill_icon1",
		["lv"] = 8,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加42%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.42",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 800,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1007",
			},
		},
	},
	["1_9"] = {
		["id"] = "1_9",
		["type"] = "army111",
		["name"] = "一闪",
		["icon"] = "skill_icon1",
		["lv"] = 9,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加43%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.43",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 900,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1008",
			},
		},
	},
	["1_10"] = {
		["id"] = "1_10",
		["type"] = "army111",
		["name"] = "一闪",
		["icon"] = "skill_icon1",
		["lv"] = 10,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加44%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.44",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 1000,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1009",
			},
		},
	},
	["2_1"] = {
		["id"] = "2_1",
		["type"] = "army111",
		["name"] = "战斗专注",
		["icon"] = "skill_icon1",
		["lv"] = 1,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "10",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加35%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.35",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1010",
			},
		},
		["point_num"] = 1100,
	},
	["2_2"] = {
		["id"] = "2_2",
		["type"] = "army111",
		["name"] = "战斗专注",
		["icon"] = "skill_icon1",
		["lv"] = 2,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "10",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加36%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.36",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 1200,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1011",
			},
		},
	},
	["2_3"] = {
		["id"] = "2_3",
		["type"] = "army111",
		["name"] = "战斗专注",
		["icon"] = "skill_icon1",
		["lv"] = 3,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "10",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加37%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.37",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 1300,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1012",
			},
		},
	},
	["2_4"] = {
		["id"] = "2_4",
		["type"] = "army111",
		["name"] = "战斗专注",
		["icon"] = "skill_icon1",
		["lv"] = 4,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "10",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加38%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.38",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 1400,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1013",
			},
		},
	},
	["2_5"] = {
		["id"] = "2_5",
		["type"] = "army111",
		["name"] = "战斗专注",
		["icon"] = "skill_icon1",
		["lv"] = 5,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "10",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加39%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.39",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 1500,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1014",
			},
		},
	},
	["2_6"] = {
		["id"] = "2_6",
		["type"] = "army111",
		["name"] = "战斗专注",
		["icon"] = "skill_icon1",
		["lv"] = 6,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "10",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加40%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.40",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1015",
			},
		},
		["point_num"] = 1600,
	},
	["2_7"] = {
		["id"] = "2_7",
		["type"] = "army111",
		["name"] = "战斗专注",
		["icon"] = "skill_icon1",
		["lv"] = 7,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "10",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加41%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.41",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 1700,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1016",
			},
		},
	},
	["2_8"] = {
		["id"] = "2_8",
		["type"] = "army111",
		["name"] = "战斗专注",
		["icon"] = "skill_icon1",
		["lv"] = 8,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "10",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加42%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.42",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 1800,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1017",
			},
		},
	},
	["2_9"] = {
		["id"] = "2_9",
		["type"] = "army111",
		["name"] = "战斗专注",
		["icon"] = "skill_icon1",
		["lv"] = 9,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "10",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加43%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.43",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 1900,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1018",
			},
		},
	},
	["2_10"] = {
		["id"] = "2_10",
		["type"] = "army111",
		["name"] = "战斗专注",
		["icon"] = "skill_icon1",
		["lv"] = 10,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "10",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加44%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.44",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 2000,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1019",
			},
		},
	},
	["3_1"] = {
		["id"] = "3_1",
		["type"] = "army111_1",
		["name"] = "剑刃回旋",
		["icon"] = "skill_icon1",
		["lv"] = 1,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加35%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.35",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1020",
			},
		},
		["point_num"] = 2100,
	},
	["3_2"] = {
		["id"] = "3_2",
		["type"] = "army111_1",
		["name"] = "剑刃回旋",
		["icon"] = "skill_icon1",
		["lv"] = 2,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加36%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.36",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 2200,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1021",
			},
		},
	},
	["3_3"] = {
		["id"] = "3_3",
		["type"] = "army111_1",
		["name"] = "剑刃回旋",
		["icon"] = "skill_icon1",
		["lv"] = 3,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加37%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.37",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 2300,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1022",
			},
		},
	},
	["3_4"] = {
		["id"] = "3_4",
		["type"] = "army111_1",
		["name"] = "剑刃回旋",
		["icon"] = "skill_icon1",
		["lv"] = 4,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加38%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.38",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 2400,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1023",
			},
		},
	},
	["3_5"] = {
		["id"] = "3_5",
		["type"] = "army111_1",
		["name"] = "剑刃回旋",
		["icon"] = "skill_icon1",
		["lv"] = 5,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加39%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.39",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 2500,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1024",
			},
		},
	},
	["3_6"] = {
		["id"] = "3_6",
		["type"] = "army111_1",
		["name"] = "剑刃回旋",
		["icon"] = "skill_icon1",
		["lv"] = 6,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加40%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.40",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1025",
			},
		},
		["point_num"] = 2600,
	},
	["3_7"] = {
		["id"] = "3_7",
		["type"] = "army111_1",
		["name"] = "剑刃回旋",
		["icon"] = "skill_icon1",
		["lv"] = 7,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加41%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.41",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 2700,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1026",
			},
		},
	},
	["3_8"] = {
		["id"] = "3_8",
		["type"] = "army111_1",
		["name"] = "剑刃回旋",
		["icon"] = "skill_icon1",
		["lv"] = 8,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加42%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.42",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 2800,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1027",
			},
		},
	},
	["3_9"] = {
		["id"] = "3_9",
		["type"] = "army111_1",
		["name"] = "剑刃回旋",
		["icon"] = "skill_icon1",
		["lv"] = 9,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加43%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.43",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 2900,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1028",
			},
		},
	},
	["3_10"] = {
		["id"] = "3_10",
		["type"] = "army111_1",
		["name"] = "剑刃回旋",
		["icon"] = "skill_icon1",
		["lv"] = 10,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加44%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.44",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 3000,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1029",
			},
		},
	},
	["4_1"] = {
		["id"] = "4_1",
		["type"] = "army111_1",
		["name"] = "大剑题之誓",
		["icon"] = "skill_icon1",
		["lv"] = 1,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加35%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.35",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1030",
			},
		},
		["point_num"] = 3100,
	},
	["4_2"] = {
		["id"] = "4_2",
		["type"] = "army111_1",
		["name"] = "大剑题之誓",
		["icon"] = "skill_icon1",
		["lv"] = 2,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加36%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.36",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 3200,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1031",
			},
		},
	},
	["4_3"] = {
		["id"] = "4_3",
		["type"] = "army111_1",
		["name"] = "大剑题之誓",
		["icon"] = "skill_icon1",
		["lv"] = 3,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加37%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.37",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 3300,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1032",
			},
		},
	},
	["4_4"] = {
		["id"] = "4_4",
		["type"] = "army111_1",
		["name"] = "大剑题之誓",
		["icon"] = "skill_icon1",
		["lv"] = 4,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加38%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.38",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 3400,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1033",
			},
		},
	},
	["4_5"] = {
		["id"] = "4_5",
		["type"] = "army111_1",
		["name"] = "大剑题之誓",
		["icon"] = "skill_icon1",
		["lv"] = 5,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加39%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.39",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 3500,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1034",
			},
		},
	},
	["4_6"] = {
		["id"] = "4_6",
		["type"] = "army111_1",
		["name"] = "大剑题之誓",
		["icon"] = "skill_icon1",
		["lv"] = 6,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加40%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.40",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1035",
			},
		},
		["point_num"] = 3600,
	},
	["4_7"] = {
		["id"] = "4_7",
		["type"] = "army111_1",
		["name"] = "大剑题之誓",
		["icon"] = "skill_icon1",
		["lv"] = 7,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加41%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.41",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 3700,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1036",
			},
		},
	},
	["4_8"] = {
		["id"] = "4_8",
		["type"] = "army111_1",
		["name"] = "大剑题之誓",
		["icon"] = "skill_icon1",
		["lv"] = 8,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加42%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.42",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 3800,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1037",
			},
		},
	},
	["4_9"] = {
		["id"] = "4_9",
		["type"] = "army111_1",
		["name"] = "大剑题之誓",
		["icon"] = "skill_icon1",
		["lv"] = 9,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加43%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.43",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 3900,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1038",
			},
		},
	},
	["4_10"] = {
		["id"] = "4_10",
		["type"] = "army111_1",
		["name"] = "大剑题之誓",
		["icon"] = "skill_icon1",
		["lv"] = 10,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加44%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.44",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 4000,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1039",
			},
		},
	},
	["5_1"] = {
		["id"] = "5_1",
		["type"] = "army111_2",
		["name"] = "灵剑拂尘",
		["icon"] = "skill_icon1",
		["lv"] = 1,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加35%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.35",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1040",
			},
		},
		["point_num"] = 4100,
	},
	["5_2"] = {
		["id"] = "5_2",
		["type"] = "army111_2",
		["name"] = "灵剑拂尘",
		["icon"] = "skill_icon1",
		["lv"] = 2,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加36%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.36",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 4200,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1041",
			},
		},
	},
	["5_3"] = {
		["id"] = "5_3",
		["type"] = "army111_2",
		["name"] = "灵剑拂尘",
		["icon"] = "skill_icon1",
		["lv"] = 3,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加37%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.37",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 4300,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1042",
			},
		},
	},
	["5_4"] = {
		["id"] = "5_4",
		["type"] = "army111_2",
		["name"] = "灵剑拂尘",
		["icon"] = "skill_icon1",
		["lv"] = 4,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加38%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.38",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 4400,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1043",
			},
		},
	},
	["5_5"] = {
		["id"] = "5_5",
		["type"] = "army111_2",
		["name"] = "灵剑拂尘",
		["icon"] = "skill_icon1",
		["lv"] = 5,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加39%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.39",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 4500,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1044",
			},
		},
	},
	["5_6"] = {
		["id"] = "5_6",
		["type"] = "army111_2",
		["name"] = "灵剑拂尘",
		["icon"] = "skill_icon1",
		["lv"] = 6,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加40%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.40",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1045",
			},
		},
		["point_num"] = 4600,
	},
	["5_7"] = {
		["id"] = "5_7",
		["type"] = "army111_2",
		["name"] = "灵剑拂尘",
		["icon"] = "skill_icon1",
		["lv"] = 7,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加41%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.41",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 4700,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1046",
			},
		},
	},
	["5_8"] = {
		["id"] = "5_8",
		["type"] = "army111_2",
		["name"] = "灵剑拂尘",
		["icon"] = "skill_icon1",
		["lv"] = 8,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加42%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.42",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 4800,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1047",
			},
		},
	},
	["5_9"] = {
		["id"] = "5_9",
		["type"] = "army111_2",
		["name"] = "灵剑拂尘",
		["icon"] = "skill_icon1",
		["lv"] = 9,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加43%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.43",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 4900,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1048",
			},
		},
	},
	["5_10"] = {
		["id"] = "5_10",
		["type"] = "army111_2",
		["name"] = "灵剑拂尘",
		["icon"] = "skill_icon1",
		["lv"] = 10,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加44%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.44",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 5000,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1049",
			},
		},
	},
	["6_1"] = {
		["id"] = "6_1",
		["type"] = "army111_2",
		["name"] = "精灵庇佑",
		["icon"] = "skill_icon1",
		["lv"] = 1,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加35%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.35",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1050",
			},
		},
		["point_num"] = 5100,
	},
	["6_2"] = {
		["id"] = "6_2",
		["type"] = "army111_2",
		["name"] = "精灵庇佑",
		["icon"] = "skill_icon1",
		["lv"] = 2,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加36%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.36",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 5200,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1051",
			},
		},
	},
	["6_3"] = {
		["id"] = "6_3",
		["type"] = "army111_2",
		["name"] = "精灵庇佑",
		["icon"] = "skill_icon1",
		["lv"] = 3,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加37%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.37",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 5300,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1052",
			},
		},
	},
	["6_4"] = {
		["id"] = "6_4",
		["type"] = "army111_2",
		["name"] = "精灵庇佑",
		["icon"] = "skill_icon1",
		["lv"] = 4,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加38%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.38",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 5400,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1053",
			},
		},
	},
	["6_5"] = {
		["id"] = "6_5",
		["type"] = "army111_2",
		["name"] = "精灵庇佑",
		["icon"] = "skill_icon1",
		["lv"] = 5,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加39%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.39",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 5500,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1054",
			},
		},
	},
	["6_6"] = {
		["id"] = "6_6",
		["type"] = "army111_2",
		["name"] = "精灵庇佑",
		["icon"] = "skill_icon1",
		["lv"] = 6,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加40%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.40",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1055",
			},
		},
		["point_num"] = 5600,
	},
	["6_7"] = {
		["id"] = "6_7",
		["type"] = "army111_2",
		["name"] = "精灵庇佑",
		["icon"] = "skill_icon1",
		["lv"] = 7,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加41%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.41",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 5700,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1056",
			},
		},
	},
	["6_8"] = {
		["id"] = "6_8",
		["type"] = "army111_2",
		["name"] = "精灵庇佑",
		["icon"] = "skill_icon1",
		["lv"] = 8,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加42%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.42",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 5800,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1057",
			},
		},
	},
	["6_9"] = {
		["id"] = "6_9",
		["type"] = "army111_2",
		["name"] = "精灵庇佑",
		["icon"] = "skill_icon1",
		["lv"] = 9,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加43%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.43",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 5900,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1058",
			},
		},
	},
	["6_10"] = {
		["id"] = "6_10",
		["type"] = "army111_2",
		["name"] = "精灵庇佑",
		["icon"] = "skill_icon1",
		["lv"] = 10,
		["unlock"] = {
			[1] = {
				[1] = "level",
				[2] = "1",
			},
		},
		["trigger"] = {
			[1] = {
				[1] = "1",
				[2] = "100",
			},
		},
		["intro"] = "对前方一格的敌方单位造成我方单元格内人数每+1增加44%的伤害",
		["skill"] = {
			[1] = {
				[1] = "num_atk",
				[2] = "0.44",
			},
		},
		["buff"] = {
			[1] = {
				[1] = "slowdown",
				[2] = "0.5",
				[3] = "5",
			},
		},
		["features_a"] = {
			[1] = {
				[1] = "kill_refresh",
				[2] = "1",
				[3] = "1",
			},
		},
		["features_b"] = {
			[1] = {
				[1] = "kill_speedup",
				[2] = "1",
				[3] = "3",
			},
		},
		["point_num"] = 6000,
		["require"] = {
			[1] = {
				[1] = "coin",
				[2] = "coin1",
				[3] = "1059",
			},
		},
	},
}
