return {
	["1"] = {
		["id"] = "1",
		["name"] = "PT掉落量",
		["des"] = "局内PT掉落量+x%",
	},
	["2"] = {
		["id"] = "2",
		["name"] = "金币结算量",
		["des"] = "整局结算时金币的获取量+x%",
	},
	["3"] = {
		["id"] = "3",
		["name"] = "材料掉落率",
		["des"] = "材料掉落概率+x%",
	},
	["4"] = {
		["id"] = "4",
		["name"] = "card_1效果提升",
		["des"] = "card_1效果提升",
	},
	["5"] = {
		["id"] = "5",
		["name"] = "card_2效果提升",
		["des"] = "card_2效果提升",
	},
	["6"] = {
		["id"] = "6",
		["name"] = "card_3效果提升",
		["des"] = "card_3效果提升",
	},
	["7"] = {
		["id"] = "7",
		["name"] = "card_4效果提升",
		["des"] = "card_4效果提升",
	},
	["8"] = {
		["id"] = "8",
		["name"] = "card_5效果提升",
		["des"] = "card_5效果提升",
	},
}
